БухЭксп/InformationRegisters/CW_НумерацияДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НумерацияДоговоров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрефиксНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_НумерацияДоговоров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция - Получить последний номер
//
// Получает последний записанный номер для указанного префикса
//
// Параметры:
//  Параметры	 - 	Структура("ПрефиксНомера",)  
// 
// Возвращаемое значение:
//   - число
//
Функция ПолучитьПоследнийНомер(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НумерацияДоговоров.ПрефиксНомера КАК ПрефиксНомера,
	               |	CW_НумерацияДоговоров.Номер КАК Номер
	               |ИЗ
	               |	РегистрСведений.CW_НумерацияДоговоров КАК CW_НумерацияДоговоров
	               |ГДЕ
	               |	CW_НумерацияДоговоров.ПрефиксНомера = &ПрефиксНомера";
	
	Запрос.УстановитьПараметр("ПрефиксНомера", Параметры.ПрефиксНомера);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		 Возврат Выборка.Номер;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Процедура - Записать последний номер
//
// Записывает текущий номер для указанного префикса
//
// Параметры:
//  Параметры	 - 	Структура("ПрефиксНомера,Номер",)  
//
Процедура ЗаписатьПоследнийНомер(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запись = РегистрыСведений.CW_НумерацияДоговоров.СоздатьМенеджерЗаписи();
	Запись.ПрефиксНомера 	= Параметры.ПрефиксНомера;
	Запись.Номер			= Параметры.Номер;
	
	Запись.Записать(Истина);
	
КонецПроцедуры
#КонецЕсли
